<!-- dflook/terraform-github-actions {"workspace":"docs-gen-2","backend_type":"remote","backend":"2fd754fa5f2c87e735a5f954dcba6638a74530d26c34393f0c3e25d800d91c00","plan_job_ref":"Job Test Terraform cloud #284 at https://github.com/dflook/terraform-github-actions/actions/runs/13548761094","plan_hash":"1083dd902875ffde228972d9af129625c9cd50ef8271fa338dcbbb1c04e74ef8","plan_text_format":"diff","version":"99.0.0"} -->
Terraform plan in __tests/workflows/test-cloud/1.0__ in the __docs-gen-2__ workspace
With var files: `tests/workflows/test-cloud/1.0/my_variable.tfvars
`
With variables: `from_variables = "from_variables"`
<details>
<summary>Plan: 1 to add, 0 to change, 0 to destroy. Changes to Outputs.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+   create

Terraform will perform the following actions:

  # random_id.the_id will be created
+   resource "random_id" "the_id" {
+       b64_std     = (known after apply)
+       b64_url     = (known after apply)
+       byte_length = 5
+       dec         = (known after apply)
+       hex         = (known after apply)
+       id          = (known after apply)
    }

Plan: 1 to add, 0 to change, 0 to destroy.

Changes to Outputs:
+   default        = "default"
+   from_tfvars    = "from_tfvars"
+   from_variables = "from_variables"
```
</details>

:memo: Plan generated in [Test Terraform cloud #284](https://github.com/dflook/terraform-github-actions/actions/runs/13548761094)